---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewDoubleArray
source: html/adee56a7-526c-7717-5425-ba8e35af9ec8.htm
---
# Autodesk.Revit.Creation.Application.NewDoubleArray Method

Creates a new instance of a double array.

## Syntax (C#)
```csharp
public DoubleArray NewDoubleArray()
```